update docs with mmd
